package net.wisedog.android.whooing.sms;

import java.util.regex.Pattern;

public class AcceptableSmsFilter
{
  private static final String BLACK_LIST_REG_EX = ".*((CMS)|(ARS)|(CD/ATM)|(INFOCARE)|(MPOST)|(M포인트몰)|(포인트사용)|(SMARTBANK)|(SMS인증번호)|(U-POINT)|(가입)|(가입하셨습니다)|(거부)|(거절)|(결제금액)|(결제대금)|(결제바랍니다)|(결제비율)|(결제시차감청구)|(결제예정)|(결제일)|(결제지연)|(공인인증서)|(금융사기)|(기준일)|(납부하실)|(납부지연)|(납입일)|(누설)|(다운로드)|(담당플래너)|(대리전달)|(대출)|(대출이자)|(도난분실)|(되셨습니다)|(되셨읍니다)|(드렸습니다)|(등급)|(등록됐습니다)|(등록되었습니다)|(등록완료)|(리볼빙)|(마이신한P)|(만족도조사)|(매출접수)|(모바일명세서)|(모바일뱅킹)|(문의)|(미납)|(미수령건)|(반송되었습니다)|(발급)|(배송)|(변경되었습니다)|(변경됐습니다)|(보안)|(보안강화)|(보안승급)|(보안카드)|(보이스피싱)|(보조금잔액)|(본인인증)|(부과됐습니다)|(부족)|(부탁드립니다)|(분실도난)|(분실신고)|(분실해제)|(비밀번호)|(사용등록)|(사용제한)|(상이합니다.)|(상환)|(상환)|(설치주소)|(송금)|(수령등록)|(수신여부)|(스피드론)|(승\\*급)|(승인거절)|(승인되지않았습니다)|(신고바랍니다)|(신고요망)|(신용정보)|(신용조회)|(신청하신)|(안심클릭비밀번호)|(안심클릭서비스)|(안전결제)|(압류)|(연락드리겠습니다)|(연락바랍니다)|(연체)|(완료되었습니다)|(예정입니다)|(요청하신)|(원리금)|(은행)|(이메일주소)|(이용정지)|(이용한도)|(이자율)|(이체등록)|(인증번호)|(인증서)|(인출완료)|(인터넷뱅킹)|(일시정지)|(입금)|(입금예정)|(자동이체)|(자유결제)|(잔액부족)|(잔여한도)|(재발급)|(적립되었습니다)|(적립됩니다)|(전달되었습니다)|(전송합니다)|(전화금융사기)|(전화상담)|(접수되었습니다)|(정보변경)|(정상처리)|(정지되셨습니다)|(제로할부)|(조정되었습니다.)|(종금)|(종료됩니다)|(증권)|(첫거래)|(청구서)|(출금)|(출금취소)|(취소)|(카드\\(론\\))|(카드론)|(카드명세서)|(카드출금)|(캐시백\\(충전\\)되었습니다)|(타금융기관)|(쿠폰번호)|(패스워드)|(폰뱅킹)|(푸짐한경품)|(하나SK캐쉬백)|(한도초과)|(해지)|(현금S승인)|(현금서비스)|(홈페이지)|(확인)|(환불)|(바랍니다)|(회원님)|(이월잔액원금)|(고메위크)|(클럽서비스대상점)|(가능하십니다)|(승인내역문자메시지)|(쿠폰번호)|(우리6)|(우리1)|(우리은행)|(재등록)|(수령)|(신분증)|(오픈행사)|(이상사용시)|(크로스마일)|(세이브이용가능)|(초과했습니다)|(통화버튼)|(전환됩니다)|(초과승인되었습니다)|(생일축하드립니다)|(리터입니다)|(혜택)|(112신고)|(포인트지급)|(축하드립니다)|(알림서비스)|(결제하실)|(할인한도액)|(시큐어코드)|(카드고객)|(%세일)|(청구할인)|(다운받기)|(첫이용)|(수익율)|(차감가맹점)|(수익률)|(주문자)|(연락주세요)|(증정)|(분실정지)|(한도상향)|(배달완료)|(자동이체미처리)|(분실정지)|(부자되세요)|(세이브결제시)|(카드신청)|(카드채무)|(생일을)|(총한도)|(일시한도)|(신용보호서비스)|(안내서비스)|(서비스변경)|(설문조사)|(전달하였습니다)|(SMS서비스)|(안심신용보호)|(카드계좌)|(카드대금)|(신용지킴이)|(할부금융)|(POINT.*PLUS)|(배달예정)|(신용변동)|(명의도용))+.*";
  private static final String WHITE_LIST_REG_EX = ".*((경남BC)|(MYCOMPANY)|(BC\\()|(KBBC)|(KB국민)|(KB듀얼)|(KB체크)|(KB카드)|(MG체크카드)|(NHBC)|(NH체크)|(NH카드)|(갤러리아카드)|(광주BC)|(광주카드)|(국민BC)|(국민비씨)|(기업BC)|(농협BC)|(대구BC)|(롯데법인)|(롯데카드)|(부산BC)|(산업BC)|(삼성가족카드)|(삼성체크카드)|(삼성법인)|(삼성카드)|(수협카드)|(스탠다드차타드BC)|(신한BC)|(신한체크)|(신한법인)|(신한카드)|(씨티BC)|(씨티카드)|(외환BC)|(외환카드)|(우리BC)|(우리카드)|(전북BC)|(제주BC)|(제주카드)|(하나BC)|(하나비씨)|(하나SK\\()|(하나SKBC)|(하나SK체크)|(하나SK카드)|(현대백화점카드)|(현대카드)|(JBCARD)|(롯데.*일시불)|(롯데.*할부)|(롯데.*승인)|(우체국.*승인)|(현대복지.*승인)|(현대스위스.*승인))+.*";

  static boolean isAcceptableBaseOnBlackList(String paramString)
  {
    if (Pattern.matches(".*((CMS)|(ARS)|(CD/ATM)|(INFOCARE)|(MPOST)|(M포인트몰)|(포인트사용)|(SMARTBANK)|(SMS인증번호)|(U-POINT)|(가입)|(가입하셨습니다)|(거부)|(거절)|(결제금액)|(결제대금)|(결제바랍니다)|(결제비율)|(결제시차감청구)|(결제예정)|(결제일)|(결제지연)|(공인인증서)|(금융사기)|(기준일)|(납부하실)|(납부지연)|(납입일)|(누설)|(다운로드)|(담당플래너)|(대리전달)|(대출)|(대출이자)|(도난분실)|(되셨습니다)|(되셨읍니다)|(드렸습니다)|(등급)|(등록됐습니다)|(등록되었습니다)|(등록완료)|(리볼빙)|(마이신한P)|(만족도조사)|(매출접수)|(모바일명세서)|(모바일뱅킹)|(문의)|(미납)|(미수령건)|(반송되었습니다)|(발급)|(배송)|(변경되었습니다)|(변경됐습니다)|(보안)|(보안강화)|(보안승급)|(보안카드)|(보이스피싱)|(보조금잔액)|(본인인증)|(부과됐습니다)|(부족)|(부탁드립니다)|(분실도난)|(분실신고)|(분실해제)|(비밀번호)|(사용등록)|(사용제한)|(상이합니다.)|(상환)|(상환)|(설치주소)|(송금)|(수령등록)|(수신여부)|(스피드론)|(승\\*급)|(승인거절)|(승인되지않았습니다)|(신고바랍니다)|(신고요망)|(신용정보)|(신용조회)|(신청하신)|(안심클릭비밀번호)|(안심클릭서비스)|(안전결제)|(압류)|(연락드리겠습니다)|(연락바랍니다)|(연체)|(완료되었습니다)|(예정입니다)|(요청하신)|(원리금)|(은행)|(이메일주소)|(이용정지)|(이용한도)|(이자율)|(이체등록)|(인증번호)|(인증서)|(인출완료)|(인터넷뱅킹)|(일시정지)|(입금)|(입금예정)|(자동이체)|(자유결제)|(잔액부족)|(잔여한도)|(재발급)|(적립되었습니다)|(적립됩니다)|(전달되었습니다)|(전송합니다)|(전화금융사기)|(전화상담)|(접수되었습니다)|(정보변경)|(정상처리)|(정지되셨습니다)|(제로할부)|(조정되었습니다.)|(종금)|(종료됩니다)|(증권)|(첫거래)|(청구서)|(출금)|(출금취소)|(취소)|(카드\\(론\\))|(카드론)|(카드명세서)|(카드출금)|(캐시백\\(충전\\)되었습니다)|(타금융기관)|(쿠폰번호)|(패스워드)|(폰뱅킹)|(푸짐한경품)|(하나SK캐쉬백)|(한도초과)|(해지)|(현금S승인)|(현금서비스)|(홈페이지)|(확인)|(환불)|(바랍니다)|(회원님)|(이월잔액원금)|(고메위크)|(클럽서비스대상점)|(가능하십니다)|(승인내역문자메시지)|(쿠폰번호)|(우리6)|(우리1)|(우리은행)|(재등록)|(수령)|(신분증)|(오픈행사)|(이상사용시)|(크로스마일)|(세이브이용가능)|(초과했습니다)|(통화버튼)|(전환됩니다)|(초과승인되었습니다)|(생일축하드립니다)|(리터입니다)|(혜택)|(112신고)|(포인트지급)|(축하드립니다)|(알림서비스)|(결제하실)|(할인한도액)|(시큐어코드)|(카드고객)|(%세일)|(청구할인)|(다운받기)|(첫이용)|(수익율)|(차감가맹점)|(수익률)|(주문자)|(연락주세요)|(증정)|(분실정지)|(한도상향)|(배달완료)|(자동이체미처리)|(분실정지)|(부자되세요)|(세이브결제시)|(카드신청)|(카드채무)|(생일을)|(총한도)|(일시한도)|(신용보호서비스)|(안내서비스)|(서비스변경)|(설문조사)|(전달하였습니다)|(SMS서비스)|(안심신용보호)|(카드계좌)|(카드대금)|(신용지킴이)|(할부금융)|(POINT.*PLUS)|(배달예정)|(신용변동)|(명의도용))+.*", paramString));
    for (boolean bool = false; ; bool = true)
      return bool;
  }

  static boolean isAcceptableBaseOnWhiteList(String paramString)
  {
    if (Pattern.matches(".*((경남BC)|(MYCOMPANY)|(BC\\()|(KBBC)|(KB국민)|(KB듀얼)|(KB체크)|(KB카드)|(MG체크카드)|(NHBC)|(NH체크)|(NH카드)|(갤러리아카드)|(광주BC)|(광주카드)|(국민BC)|(국민비씨)|(기업BC)|(농협BC)|(대구BC)|(롯데법인)|(롯데카드)|(부산BC)|(산업BC)|(삼성가족카드)|(삼성체크카드)|(삼성법인)|(삼성카드)|(수협카드)|(스탠다드차타드BC)|(신한BC)|(신한체크)|(신한법인)|(신한카드)|(씨티BC)|(씨티카드)|(외환BC)|(외환카드)|(우리BC)|(우리카드)|(전북BC)|(제주BC)|(제주카드)|(하나BC)|(하나비씨)|(하나SK\\()|(하나SKBC)|(하나SK체크)|(하나SK카드)|(현대백화점카드)|(현대카드)|(JBCARD)|(롯데.*일시불)|(롯데.*할부)|(롯데.*승인)|(우체국.*승인)|(현대복지.*승인)|(현대스위스.*승인))+.*", paramString));
    for (boolean bool = true; ; bool = false)
      return bool;
  }

  public static boolean isAcceptableSmsMessage(String paramString)
  {
      return false;
    /*boolean bool = false;
    if (paramString == null);
    while (true)
    {
      return bool;
      String str = paramString.replaceAll("\\s", "").toUpperCase();
      if ((isAcceptableBaseOnWhiteList(str)) && (isAcceptableBaseOnBlackList(str)))
        bool = true;
    }*/
  }
}

/* Location:           /home/newmoni/extract/download/com.nhn.android.moneybook/
 * Qualified Name:     com.nhn.android.moneybook.sms.AcceptableSmsFilter
 * JD-Core Version:    0.6.2
 */